<template>
  <h1>Сборник рецептов по принципу “Чем проще - тем лучше”</h1>
  <section class="q-pa-sm">
    <em>Keep it short and simple</em>
    <h2>Чего здесь не будет</h2>
    <ul class="list-style-type-wrong">
      <li>
        сложных рецептов, в которых больше 10 ингредиентов, à la “равиоли со шпинатом и рикоттой в шалфейном масле”
      </li>
      <li>вводной информации об истории рецепта</li>
      <li>выпечки, чтобы не мыть гору посуды</li>
      <li>пошаговых фото</li>
      <li>рекламы</li>
    </ul>
  </section>
  <section class="q-pa-sm">
    <h2>Основные функции</h2>
    <ul class="list-style-type-feature">
      <li>
        Поиск
        <ul class="list-style-type-diamond">
          <li>По названию</li>
          <li>По ингредиентам</li>
        </ul>
      </li>
      <li>
        Фильтрация
        <ul class="list-style-type-diamond">
          <li>По категориям</li>
          <li>По особенностям</li>
          <li>По сезону</li>
          <li>По количеству порций</li>
        </ul>
      </li>
      <li>
        Показать ссылки на Купер. Превращает ингредиенты в ссылки для удобного поиска в Купере. Можно выбрать магазин,
        задать сортировку и включить переключатель "Со скидкой". Автоматизирует следующие действия: открыть сайт,
        выбрать магазин, ввести в строку поиска ингредиент, нажать Enter, переключить сортировку. Выбранный магазин
        сохраняется и доступен при переключении на другой рецепт.
      </li>
      <li>Показать ссылки на магазины. Превращает ингредиенты в ссылки для удобного поиска в других магазинах</li>
      <li>
        Для мобильной версии: кнопка, нажатие на которую препятствует переходу устройства в спящий режим. Пригодится,
        если руки "в муке".
      </li>
    </ul>
  </section>
</template>

<style lang="scss" scoped>
.list-style-type-wrong {
  li {
    list-style-type: '❌';
  }
}
.list-style-type-feature {
  li {
    list-style-type: '⭐️';
  }
}
.list-style-type-diamond {
  li {
    list-style-type: '🔹';
  }
}
</style>
